Funcionalidade: Identificar Sudokus inválidos

            Dado um tabuleiro de sudoku, deve-se identificar se o mesmo é válido ou não.
    Para isso checa-se se para cada região existe apenas uma única célula com cada número

    Regra: Tabuleiro válido
        Cenário: Tabuleiro vazio
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                ├───────┼───────┼───────┤
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                ├───────┼───────┼───────┤
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                │ _ _ _ │ _ _ _ │ _ _ _ │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser válido

        Cenário: Números não ferem as restrições de região
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 3 _ │ _ 7 _ │ _ _ _ │ 
                │ 6 _ _ │ 1 9 5 │ _ _ _ │ 
                │ _ 9 8 │ _ _ _ │ _ 6 _ │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ _ 6 _ │ _ _ 3 │ 
                │ 4 _ _ │ _ _ 3 │ _ _ 1 │ 
                │ _ _ _ │ _ 2 _ │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ 2 _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 _ │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser válido

    Regra: Valores repetidos
        Cenário: Coluna inicial com valores repetidos
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 3 _ │ _ 7 _ │ _ _ _ │ 
                │ 6 _ _ │ 1 9 5 │ _ _ _ │ 
                │ _ 9 8 │ _ _ _ │ _ 6 _ │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ _ 6 _ │ _ _ 3 │ 
                │ 4 _ _ │ _ _ 3 │ _ _ 1 │ 
                │ 7 _ _ │ _ 2 _ │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ 2 _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 _ │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

        Cenário: Linha inicial com valores repetidos
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 3 _ │ _ 7 _ │ 3 _ _ │ 
                │ 6 _ _ │ 1 9 5 │ _ _ _ │ 
                │ _ 9 8 │ _ _ _ │ _ 6 _ │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ _ 6 _ │ _ _ 3 │ 
                │ 4 _ _ │ _ _ 3 │ _ _ 1 │ 
                │ _ _ _ │ _ 2 _ │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ 2 _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 _ │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

        Cenário: Quadrado inicial com valores repetidos
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 _ _ │ _ 7 _ │ 3 _ _ │ 
                │ 6 _ _ │ 1 9 5 │ _ _ _ │ 
                │ _ 9 6 │ _ _ _ │ _ 6 _ │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ _ 6 _ │ _ _ 3 │ 
                │ 4 _ _ │ _ _ 3 │ _ _ 1 │ 
                │ _ _ _ │ _ 2 _ │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ 2 _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 _ │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

    Regra: Solução impossível quando célula vazia não tem candidatos possíveis
        Cenário: Linha com uma célula disponível
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 _ _ │ _ 7 _ │ 3 _ _ │ 
                │ 6 _ _ │ 1 9 5 │ _ _ _ │ 
                │ _ 9 8 │ _ _ _ │ _ 6 _ │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ _ 6 _ │ _ _ 3 │ 
                │ 4 2 6 │ 7 _ 3 │ 8 5 1 │ 
                │ _ _ _ │ _ 2 _ │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ 2 _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 _ │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

        Cenário: Coluna com uma célula disponível
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 _ _ │ _ 7 _ │ 3 _ 8 │ 
                │ 6 _ _ │ 1 _ 5 │ _ _ 7 │ 
                │ _ 9 8 │ _ _ _ │ _ 6 4 │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ _ 6 _ │ _ _ 3 │ 
                │ 4 2 6 │ 7 _ 3 │ 8 5 1 │ 
                │ _ _ _ │ _ 2 _ │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ 2 _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 9 │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

        Cenário: Quadrado com uma célula disponível
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 _ _ │ _ 7 _ │ 3 _ 8 │ 
                │ 6 _ _ │ 1 _ 5 │ _ _ 7 │ 
                │ _ 9 8 │ _ _ _ │ _ 6 4 │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ 5 6 1 │ _ _ 3 │ 
                │ 4 2 6 │ 7 _ 3 │ 8 5 1 │ 
                │ _ _ _ │ 4 2 9 │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ _ _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ _ _ _ │ _ _ _ │ _ 8 9 │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

        Cenário: Área menos óbvia
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 _ _ │ _ 7 _ │ 3 _ 8 │ 
                │ 6 _ _ │ 1 4 5 │ _ _ 7 │ 
                │ _ 9 8 │ _ _ _ │ _ 6 4 │ 
                ├───────┼───────┼───────┤
                │ 8 _ _ │ 5 6 1 │ _ _ 3 │ 
                │ 4 2 6 │ 7 _ 3 │ _ 5 1 │ 
                │ _ _ _ │ 4 2 9 │ _ _ 6 │ 
                ├───────┼───────┼───────┤
                │ _ 6 _ │ _ 5 _ │ _ _ _ │ 
                │ 7 _ _ │ 8 _ 2 │ _ _ 5 │ 
                │ 3 _ 1 │ _ _ _ │ _ 8 9 │ 
                └───────┴───────┴───────┘
                  """
             Então o jogo deve ser inválido

        Cenário: Tabuleiro completo
            Dado o tabuleiro abaixo:
            """
                ┌───────┬───────┬───────┐
                │ 5 1 6 │ 2 7 8 │ 9 3 4 │ 
                │ 2 9 4 │ 1 3 5 │ 6 8 7 │ 
                │ 3 7 8 │ 6 4 9 │ 1 5 2 │ 
                ├───────┼───────┼───────┤
                │ 8 4 1 │ 7 2 6 │ 5 9 3 │ 
                │ 6 5 2 │ 8 9 3 │ 7 4 1 │ 
                │ 9 3 7 │ 5 1 4 │ 8 2 6 │ 
                ├───────┼───────┼───────┤
                │ 4 6 3 │ 9 5 7 │ 2 1 8 │ 
                │ 7 2 9 │ 4 8 1 │ 3 6 5 │ 
                │ 1 8 5 │ 3 6 2 │ 4 7 9 │ 
                └───────┴───────┴───────┘
                  """
         Então o jogo deve ser válido
            
